garyPenhook/PyAvrOCD/svd/attiny441.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x00800024</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADC</name>
          <description>ADC Data Register  Bytes</description>
          <addressOffset>0x2</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADCSRA</name>
          <description>The ADC Control and Status register (read-only for debugger)</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADPS</name>
              <description>ADC Prescaler Select Bits</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADIE</name>
              <description>ADC Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIF</name>
              <description>ADC Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADATE</name>
              <description>ADC Auto Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSC</name>
              <description>ADC Start Conversion</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADEN</name>
              <description>ADC Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>ADC Control and Status Register B</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADTS</name>
              <description>ADC Auto Trigger Sources</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREE_RUNNING_MODE</name>
                  <description>Free Running mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANALOG_COMPARATOR_0</name>
                  <description>Analog Comparator 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL_INTERRUPT_REQUEST_0</name>
                  <description>External Interrupt Request 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER0_COMPARE_MATCH_A</name>
                  <description>Timer/Counter0 Compare Match A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER0_OVERFLOW</name>
                  <description>Timer/Counter0 Overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER1_COMPARE_MATCH_A</name>
                  <description>Timer/Counter1 Compare Match A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER1_OVERFLOW</name>
                  <description>Timer/Counter1 Overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER1_CAPTURE_EVENT</name>
                  <description>Timer/Counter1 Capture Event</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADLAR</name>
              <description>No Description.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMUXA</name>
          <description>The ADC multiplexer Selection Register A</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUX</name>
              <description>Analog Channel and Gain Selection Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMUXB</name>
          <description>The ADC multiplexer Selection Register B</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GSEL</name>
              <description>Gain Selection Bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REFS</name>
              <description>Reference Selection Bits</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR0</name>
          <description>Digital Input Disable Register 0</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC0D</name>
              <description>ADC0/AREF Digital input Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1D</name>
              <description>ADC1/AIN00 Digital input Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2D</name>
              <description>ADC2/AIN01 Digital input Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC3D</name>
              <description>ADC3/AIN10 Digital Input Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC4D</name>
              <description>ADC4/AIN11 Digital input Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC5D</name>
              <description>ADC5 Digital input Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC6D</name>
              <description>ADC6 Digital input Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC7D</name>
              <description>ADC7 Digital input Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR1</name>
          <description>Digital Input Disable Register 1</description>
          <addressOffset>0x3D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC11D</name>
              <description>ADC11 Digital input Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10D</name>
              <description>ADC10 Digital input Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC8D</name>
              <description>ADC8 Digital input Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC9D</name>
              <description>ADC9 Digital Input Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
