garyPenhook/PyAvrOCD/svd/attiny441.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x00800033</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x21</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2A</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3D</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RESET</name>
        <description>External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>PCINT0</name>
        <description>Pin Change Interrupt Request 0</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>PCINT1</name>
        <description>Pin Change Interrupt Request 1</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>Watchdog Time-out Interrupt</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_CAPT</name>
        <description>Timer/Counter1 Capture Event</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match A</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>Timer/Counter1 Compare Match B</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMPA</name>
        <description>TimerCounter0 Compare Match A</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMPB</name>
        <description>TimerCounter0 Compare Match B</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>ANA_COMP0</name>
        <description>Analog Comparator 0</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>ADC Conversion Complete</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>EE_RDY</name>
        <description>EEPROM Ready</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>ANA_COMP1</name>
        <description>Analog Comparator 1</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_CAPT</name>
        <description>Timer/Counter2 Capture Event</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_COMPA</name>
        <description>Timer/Counter2 Compare Match A</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_COMPB</name>
        <description>Timer/Counter2 Compare Match B</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_OVF</name>
        <description>Timer/Counter2 Overflow</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>SPI</name>
        <description>Serial Peripheral Interface</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>USART0_START</name>
        <description>USART0, Start</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>USART0_RX</name>
        <description>USART0, Rx Complete</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>USART0_UDRE</name>
        <description>USART0 Data Register Empty</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>USART0_TX</name>
        <description>USART0, Tx Complete</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>USART1_START</name>
        <description>USART1, Start</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>USART1_RX</name>
        <description>USART1, Rx Complete</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>USART1_UDRE</name>
        <description>USART1 Data Register Empty</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>USART1_TX</name>
        <description>USART1, Tx Complete</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>TWI_SLAVE</name>
        <description>Two-wire Serial Interface</description>
        <value>29</value>
      </interrupt>
      <registers>
        <register>
          <name>CCP</name>
          <description>Configuration Change Protection</description>
          <addressOffset>0x3E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CLKCR</name>
          <description>Clock Control Register</description>
          <addressOffset>0x3F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Clock Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SUT</name>
              <description>Start-up Time</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKOUTC</name>
              <description>Clock Output (Copy). Active low.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSTR</name>
              <description>Clock Switch Trigger</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCRDY</name>
              <description>Oscillator Ready</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKPR</name>
          <description>Clock Prescale Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>Clock Prescaler Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR0</name>
          <description>General Purpose I/O Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR1</name>
          <description>General Purpose I/O Register 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR2</name>
          <description>General Purpose I/O Register 2</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x22</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC0</name>
              <description>Interrupt Sense Control 0 bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SM</name>
              <description>Sleep Mode Select Bits</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC Noise Reduction (If Available)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN</name>
                  <description>Power Down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STDBY</name>
                  <description>Standby</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status Register</description>
          <addressOffset>0x21</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-on reset flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BORF</name>
              <description>Brown-out Reset Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL0</name>
          <description>Oscillator Calibration Register 8MHz</description>
          <addressOffset>0x41</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCCAL1</name>
          <description>Oscillator Calibration Register 32kHz</description>
          <addressOffset>0x44</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCTCAL0A</name>
          <description>Oscillator Temperature Calibration Register A</description>
          <addressOffset>0x42</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCTCAL0B</name>
          <description>Oscillator Temperature Calibration Register B</description>
          <addressOffset>0x43</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PRR</name>
          <description>Power Reduction Register</description>
          <addressOffset>0x3D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRADC</name>
              <description>Power Reduction ADC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM0</name>
              <description>Power Reduction Timer/Counter0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM1</name>
              <description>Power Reduction Timer/Counter1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM2</name>
              <description>Power Reduction Timer/Counter2</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSPI</name>
              <description>Power Reduction SPI</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRUSART0</name>
              <description>Power Reduction USART0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRUSART1</name>
              <description>Power Reduction USART1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTWI</name>
              <description>Power Reduction TWI</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP</name>
          <description>Stack Pointer </description>
          <addressOffset>0x2A</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SPMCSR</name>
          <description>Store Program Memory Control and Status Register (read-only for debugger)</description>
          <addressOffset>0x24</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPMEN</name>
              <description>Store program Memory Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGERS</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGWRT</name>
              <description>Page Write</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFLB</name>
              <description>Read Fuse and Lock Bits</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTPB</name>
              <description>Clear Temporary Page Buffer</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSIG</name>
              <description>Read Device Signature Imprint Table</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SREG</name>
          <description>Status Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C</name>
              <description>Carry Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Z</name>
              <description>Zero Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>N</name>
              <description>Negative Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>V</name>
              <description>Two's Complement Overflow Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>S</name>
              <description>Sign Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H</name>
              <description>Half Carry Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>T</name>
              <description>Bit Copy Storage</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I</name>
              <description>Global Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
