garyPenhook/PyAvrOCD/svd/attiny441.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTB</name>
      <description>I/O Port</description>
      <baseAddress>0x00800036</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2E</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DDRB</name>
          <description>Data Direction Register, Port B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PINB</name>
          <description>Port B Data register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTB</name>
          <description>Input Pins, Port B</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTCR</name>
          <description>Port Control Register</description>
          <addressOffset>0x2E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BBMB</name>
              <description>Break-Before-Make Mode Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUEB</name>
          <description>Pull-up Enable Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI</name>
      <description>Serial Peripheral Interface</description>
      <baseAddress>0x00800065</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4B</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REMAP</name>
          <description>Remap Port Pins</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPIMAP</name>
              <description>SPI Pin Mapping</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPCR</name>
          <description>SPI Control Register</description>
          <addressOffset>0x4D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPR</name>
              <description>SPI Clock Rate Selects</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCL_4</name>
                  <description>fcl/4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCL_16</name>
                  <description>fcl/16</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCL_64</name>
                  <description>fcl/64</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCL_128</name>
                  <description>fcl/128</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Clock Phase</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Clock polarity</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MSTR</name>
              <description>Master/Slave Select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DORD</name>
              <description>Data Order</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPE</name>
              <description>SPI Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIE</name>
              <description>SPI Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDR</name>
          <description>SPI Data Register (write-only for debugger)</description>
          <addressOffset>0x4B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SPSR</name>
          <description>SPI Status Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI2X</name>
              <description>Double SPI Speed Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCOL</name>
              <description>Write Collision Flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIF</name>
              <description>SPI Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
