garyPenhook/PyAvrOCD/svd/attiny441.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC2</name>
      <description>Timer/Counter, 16-bit</description>
      <baseAddress>0x00800030</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x13</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0xB</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GTCCR</name>
          <description>General Timer/Counter Control Register</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSR</name>
              <description>Prescaler Reset Timer/CounterN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR2</name>
          <description>Timer/Counter2 Input Capture Register  Bytes</description>
          <addressOffset>0x90</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR2A</name>
          <description>Timer/Counter2 Output Compare Register A  Bytes</description>
          <addressOffset>0x94</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR2B</name>
          <description>Timer/Counter2 Output Compare Register B  Bytes</description>
          <addressOffset>0x92</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR2A</name>
          <description>Timer/Counter2 Control Register A</description>
          <addressOffset>0x9A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WGM2</name>
              <description>Pulse Width Modulator Select Bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COM2B</name>
              <description>Compare Output Mode 2B, bits</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COM2A</name>
              <description>Compare Output Mode 2A, bits</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR2B</name>
          <description>Timer/Counter2 Control Register B</description>
          <addressOffset>0x99</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS2</name>
              <description>Clock Select bits</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK_SOURCE_STOPPED</name>
                  <description>No Clock Source (Stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_NO_PRESCALING</name>
                  <description>Running, No Prescaling</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_8</name>
                  <description>Running, CLK/8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_64</name>
                  <description>Running, CLK/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_256</name>
                  <description>Running, CLK/256</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_1024</name>
                  <description>Running, CLK/1024</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_EXTCLK_TN_FALLING_EDGE</name>
                  <description>Running, ExtClk Tn Falling Edge</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_EXTCLK_TN_RISING_EDGE</name>
                  <description>Running, ExtClk Tn Rising Edge</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WGM2</name>
              <description>Waveform Generation Mode Bits</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ICES2</name>
              <description>Input Capture 2 Edge Select</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICNC2</name>
              <description>Input Capture 2 Noise Canceler</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR2C</name>
          <description>Timer/Counter2 Control Register C (write-only for debugger)</description>
          <addressOffset>0x98</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FOC2B</name>
              <description>Force Output Compare for Channel B</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC2A</name>
              <description>Force Output Compare for Channel A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT2</name>
          <description>Timer/Counter2  Bytes</description>
          <addressOffset>0x96</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR2</name>
          <description>Timer/Counter Interrupt Flag register (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV2</name>
              <description>Timer/Counter2 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF2A</name>
              <description>Timer/Counter2 Output Compare A Match Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF2B</name>
              <description>Timer/Counter2 Output Compare B Match Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICF2</name>
              <description>Timer/Counter2 Input Capture Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK2</name>
          <description>Timer/Counter2 Interrupt Mask Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOIE2</name>
              <description>Timer/Counter2 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE2A</name>
              <description>Timer/Counter2 Output Compare A Match Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE2B</name>
              <description>Timer/Counter2 Output Compare B Match Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICIE2</name>
              <description>Timer/Counter2 Input Capture Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
